<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css" integrity="sha384-9aIt2nRpC12Uk9gS9baDl411NQApFmC26EwAOH8WgZl5MYYxFfc+NcPb1dKGj7Sk" crossorigin="anonymous"><link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/5.0.0-alpha1/css/bootstrap.min.css" integrity="sha384-r4NyP46KrjDleawBgD5tp8Y7UzmLA05oM1iAEQ17CSuDqnUK2+k9luXQOfXJCJ4I" crossorigin="anonymous">
	<link rel="stylesheet" href="style.css">
	<title>Document</title>
</head>
<body>
    <?php 

include 'header.php';



 ?>
  <div class="container-sm">
	<fieldset>
		<legend>КРОК 1.7. Вираховуємо дійсну швидкість головного руху різання, vд, м/хв за формулою (8) з [2, с. 170]:</legend>
		<p>
   		<br>
   		<b>$$
			\pmb{\frac{3.14⋅D⋅N}{1000}}
		$$
    </b>
   	</p> 
		Діаметр ріжучого інструменту D, мм:
		<br><input  type="number" id="D">
		<br>
		<br>Дійсна швидкість головного руху різання nд, м/хв:
		<br>
		<select id="Nd">
   			<optgroup label="Верстат моделі 2Н118">
    			<option value="180">Перший номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    			<option value="250">Дугий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    			<option value="355">Третій номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    			<option value="500">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    			<option value="710">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    			<option value="1000">Шостий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    		</optgroup>
 			<optgroup label="Верстат моделі 2Н125">
    			<option value="49">Перший номер ступені, дійсна швидкість головного руху різання, nд=49</option>
    			<option value="63">Дугий номер ступені, дійсна швидкість головного руху різання, nд=63</option>
    			<option value="90">Третій номер ступені, дійсна швидкість головного руху різання, nд=90</option>
    			<option value="125">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=125</option>
    			<option value="180">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    			<option value="250">Шостий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    			<option value="355">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    			<option value="500">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    			<option value="710">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    			<option value="1000">Десятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    			<option value="1400">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=1400</option>
    			<option value="2000">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=2000</option>
    		</optgroup>
    		<optgroup label="Верстат моделі 2Н135">
    			<option value="31.9">Перший номер ступені, дійсна швидкість головного руху різання, nд=31.9</option>
    			<option value="45">Дугий номер ступені, дійсна швидкість головного руху різання, nд=45</option>
    			<option value="63">Третій номер ступені, дійсна швидкість головного руху різання, nд=63</option>
    			<option value="90">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=90</option>
    			<option value="125">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=125</option>
    			<option value="180">Шостий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    			<option value="250">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    			<option value="355">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    			<option value="500">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    			<option value="710">Десятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    			<option value="1000">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    			<option value="1400">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=1400</option>
   			</optgroup>
    		<optgroup label="Верстат моделі 2Н150">
    			<option value="22.4">Перший номер ступені, дійсна швидкість головного руху різання, nд=22.4</option>
    			<option value="31.5">Дугий номер ступені, дійсна швидкість головного руху різання, nд=31.5</option>
    			<option value="45">Третій номер ступені, дійсна швидкість головного руху різання, nд=45</option>
    			<option value="63">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=63</option>
    			<option value="90">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=90</option>
    			<option value="125">Шостий номер ступені, дійсна швидкість головного руху різання, nд=125</option>
    			<option value="180">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    			<option value="250">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    			<option value="355">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    			<option value="500">Десятий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    			<option value="710">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    			<option value="1000">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    		</optgroup>
    		<optgroup label="Верстат моделі 2C150">
    			<option value="675">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=675</option>
    		</optgroup>
    		<optgroup label="Верстат моделі ГС520">
    			<option value="100">Перший номер ступені, дійсна швидкість головного руху різання, nд=100</option>
    			<option value="180">Дугий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    			<option value="315">Третій номер ступені, дійсна швидкість головного руху різання, nд=315</option>
    			<option value="560">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=560</option>
    			<option value="1000">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    			<option value="1800">Шостий номер ступені, дійсна швидкість головного руху різання, nд=1800</option>
    		</optgroup>
 			<optgroup label="Верстат моделі 2А55">
    			<option value="37.5">Перший номер ступені, дійсна швидкість головного руху різання, nд=37.5</option>
    			<option value="47.5">Дугий номер ступені, дійсна швидкість головного руху різання, nд=47.5</option>
    			<option value="60">Третій номер ступені, дійсна швидкість головного руху різання, nд=60</option>
    			<option value="75">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=75</option>
    			<option value="95">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=95</option>
    			<option value="118">Шостий номер ступені, дійсна швидкість головного руху різання, nд=118</option>
    			<option value="150">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=150</option>
    			<option value="190">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=190</option>
    			<option value="235">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=235</option>
    			<option value="300">Десятий номер ступені, дійсна швидкість головного руху різання, nд=300</option>
    			<option value="375">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=375</option>
    			<option value="475">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=475</option>
    			<option value="600">Тринадцятий номер ступені, дійсна швидкість головного руху різання, nд=600</option>
    			<option value="750">Чотирнадцятий номер ступені, дійсна швидкість головного руху різання, nд=750</option>
    			<option value="950">П'ятнадцятий номер ступені, дійсна швидкість головного руху різання, nд=950</option>
    			<option value="1180">Шістнадцятий номер ступені, дійсна швидкість головного руху різання, nд=1180</option>
    			<option value="1500">Сімнадцятий номер ступені, дійсна швидкість головного руху різання, nд=1500</option>
     			<option value="1900">Вісімнадцятий номер ступені, дійсна швидкість головного руху різання, nд=1900</option>
    		</optgroup>
    	</select>
		<p id="empty_formula7">

   		</p>
      <br><br>
   
   			<p>
				   <button id="but_formula7">Вирахувати дійсну швидкість головного руху різання nд, м/хв</button>
			   </p>
   			<p>
				   <button id="generate_formula7">Згенерувати формулу</button>
			   </p>
   			<p>
				   <button  id="copyred_formula7" disabled="true">Скопіювати формулу</button>
			   </p>
   	
   		<p id="res_formula7">
   		
   		</p>
	</fieldset>
  <br>
	<fieldset>
		<legend>КРОК 1.8. Вираховуємо момент від сил опору різання при обробці, М, Н∙м, за формулою (9) з [1, с. 435]. </legend>
		<p>
   		<br>
   		$$
			\pmb{(9.81⋅{Cm}⋅{D^{qm}}⋅{So}^{ym})⋅({Кр}⋅0.101973)}
		$$
   	</p>
		Коефіцієнт формули крутного моменту, що залежить від властивостей матеріалу, який обробляється, Cм:
		<br>
		<select  id="Cm">
			<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="0.0345">0.0345</option>
			<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="0.09">0.09</option>
			<optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="0.041">0.041</option>
			</optgroup>
		</select>
		<br>
		<br>Показник степені формули крутного моменту, що залежить від властивостей матеріалу, який обробляється, qм:
		<br>
		<select  id="Qm">  
			<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="2.0">2.0</option>
			<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="1.0">1.0</option>
			<optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="2.0">2.0</option>
			</optgroup>
		</select>
		<br>
		<br>Показник степені формули о крутного моменту, що залежить від властивостей матеріалу, який обробляється, yм:
		<br><select  id="Ym">  
			<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="0.8">0.8</option>
			<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="0.8">0.8</option>
			<optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
				<option value="0.7">0.7</option>
			</optgroup>
		</select>
		<br>
		<br>Діаметр ріжучого інструменту D, мм:<br><input  type="number" id="D2">
		<br>
		<br>Подача S0, мм/об:<br><input  type="number" id="So">    
		<br> 
		<br>Поправочний коефіцієнт на осьову складову сили різання, Kp:
		<br><input  type="number" id="Kr">   
		<p id="empty_formula8">

   	</p>
    <br><br>

   		<p>
			   <button id="but_formula8">Вирахувати крутний момент від сил опору різання при свердлінні М, Нм</button>
		   </p>
   		<p>
			   <button id="generate_formula8">Згенерувати формулу</button>
		   </p>
   		<p>
			   <button  id="copyred_formula8" disabled="true">Скопіювати формулу</button>
		   </p>

   	<p id="res_formula8">
   		
   	</p>
	</fieldset>	

    <?php 

include 'footer.php';



 ?>
  </div>
</body>
</html>